In [2]:
import pandas as pd
import numpy as np

In [4]:
np.random.seed(101)

In [10]:
df = pd.DataFrame(data=np.random.randn(5,4), index=["A","B","C","D","E"], columns=["W","X","Y","Z"])

In [12]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [14]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [16]:
bol = df > 0

In [18]:
df[bol]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [20]:
df[df["W"]>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [22]:
df[df["W"]>0]["Y"]

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [25]:
df[(df["W"]>0) & (df["Y"]<1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [31]:
df.reset_index(inplace=True)

In [33]:
df

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [36]:
col = ["BA", "SE", "AL", "PE", "PB"]

In [38]:
df["Estado"] = col

In [40]:
df

  index         W         X         Y         Z Estado
0     A  0.302665  1.693723 -1.706086 -1.159119     BA
1     B -0.134841  0.390528  0.166905  0.184502     SE
2     C  0.807706  0.072960  0.638787  0.329646     AL
3     D -0.497104 -0.754070 -0.943406  0.484752     PE
4     E -0.116773  1.901755  0.238127  1.996652     PB

In [44]:
df.set_index("Estado", inplace=True) # Os estados se tornam índices.

In [45]:
df

       index         W         X         Y         Z
Estado
BA         A  0.302665  1.693723 -1.706086 -1.159119
SE         B -0.134841  0.390528  0.166905  0.184502
AL         C  0.807706  0.072960  0.638787  0.329646
PE         D -0.497104 -0.754070 -0.943406  0.484752
PB         E -0.116773  1.901755  0.238127  1.996652